000_РОЗНИЦА_ЦЕНТР/src/Documents/ОтгрузкаРекламныхМатериалов/ОтгрузкаРекламныхМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтгрузкаРекламныхМатериалов</name>
  <registerRecords>AccumulationRegister.РекламныеМатериалыКОтгрузке</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РекламныеМатериалы</name>
    <attributes>
      <name>РекламныйМатериал</name>
      <type>
        <types>CatalogRef.РекламныеМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РекламнаяПлоскость</name>
      <type>
        <types>CatalogRef.РекламныеПлоскости</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПриемки</name>
      <type>
        <types>DocumentRef.ПриемкаРекламныхМатериалов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРаспоряжение</name>
      <type>
        <types>DocumentRef.РаспоряжениеНаПриемку</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

000_РОЗНИЦА_ЦЕНТР/src/AccumulationRegisters/РекламныеМатериалыКОтгрузке/РекламныеМатериалыКОтгрузке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РекламныеМатериалыКОтгрузке</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>РекламныйМатериал</name>
    <type>
      <types>CatalogRef.РекламныеМатериалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РекламнаяПлоскость</name>
    <type>
      <types>CatalogRef.РекламныеПлоскости</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПриемки</name>
    <type>
      <types>DocumentRef.ПриемкаРекламныхМатериалов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРаспоряжение</name>
    <type>
      <types>DocumentRef.РаспоряжениеНаПриемку</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Documents/ОтгрузкаРекламныхМатериалов/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РекламныеМатериалыКОтгрузкеОстатки.РекламныйМатериал КАК РекламныйМатериал,
		|	РекламныеМатериалыКОтгрузкеОстатки.РекламнаяПлоскость КАК РекламнаяПлоскость,
		|	СУММА(РекламныеМатериалыКОтгрузкеОстатки.КоличествоОстаток) КАК Количество,
		|	РекламныеМатериалыКОтгрузкеОстатки.ДокументПриемки КАК ДокументПриемки,
		|	РекламныеМатериалыКОтгрузкеОстатки.ДокументРаспоряжение КАК ДокументРаспоряжение
		|ИЗ
		|	РегистрНакопления.РекламныеМатериалыКОтгрузке.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И Магазин = &Магазин) КАК РекламныеМатериалыКОтгрузкеОстатки
		|ГДЕ
		|	 РекламныеМатериалыКОтгрузкеОстатки.ДокументРаспоряжение.ДатаПо < &Период
		
		|
		|СГРУППИРОВАТЬ ПО
		|	РекламныеМатериалыКОтгрузкеОстатки.РекламныйМатериал,
		|	РекламныеМатериалыКОтгрузкеОстатки.РекламнаяПлоскость,
		|	РекламныеМатериалыКОтгрузкеОстатки.ДокументПриемки,
		|	РекламныеМатериалыКОтгрузкеОстатки.ДокументРаспоряжение";
	
	Запрос.УстановитьПараметр("Магазин", Объект.Магазин);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Объект.РекламныеМатериалы.Загрузить(РезультатЗапроса.Выгрузить())	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Организация) тогда 	
		Объект.Организация = ОбщегоНазначенияРТ.ПолучитьУчетнуюПолитику().ОсновнаяОрганизация; 
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Магазин) тогда 	
		Объект.Магазин = ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин; 
	КонецЕсли;    	
	Если Не ЗначениеЗаполнено(Объект.Ответственный) тогда 	
			Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;    	

	УправлениеДоступомРТ.ПриСозданииФормыНаСервере(ЭтотОбъект);	//	LNK 17.10.2019 14:30:01

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстаткамиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РекламныеМатериалыКОтгрузкеОстатки.РекламныйМатериал КАК РекламныйМатериал,
		|	РекламныеМатериалыКОтгрузкеОстатки.РекламнаяПлоскость КАК РекламнаяПлоскость,
		|	СУММА(РекламныеМатериалыКОтгрузкеОстатки.КоличествоОстаток) КАК Количество,
		|	РекламныеМатериалыКОтгрузкеОстатки.ДокументПриемки КАК ДокументПриемки,
		|	РекламныеМатериалыКОтгрузкеОстатки.ДокументРаспоряжение КАК ДокументРаспоряжение
		|ИЗ
		|	РегистрНакопления.РекламныеМатериалыКОтгрузке.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И Магазин = &Магазин) КАК РекламныеМатериалыКОтгрузкеОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	РекламныеМатериалыКОтгрузкеОстатки.РекламныйМатериал,
		|	РекламныеМатериалыКОтгрузкеОстатки.РекламнаяПлоскость,
		|	РекламныеМатериалыКОтгрузкеОстатки.ДокументПриемки,
		|	РекламныеМатериалыКОтгрузкеОстатки.ДокументРаспоряжение";
	
	Запрос.УстановитьПараметр("Магазин", Объект.Магазин);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Объект.РекламныеМатериалы.Загрузить(РезультатЗапроса.Выгрузить())	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстатками(Команда)
	ЗаполнитьОстаткамиНаСервере();
КонецПроцедуры
